Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.110/PIC32CM-LS60/svd/PIC32CM1216LS60048.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="PAC">
         <name>PAC_SEC</name>
         <prependToName>PAC_SEC_</prependToName>
         <baseAddress>0x40000200</baseAddress>
      </peripheral>
      <peripheral>
         <name>PM</name>
         <version>U22403c0</version>
         <description>Power Manager</description>
         <groupName>PM</groupName>
         <prependToName>PM_</prependToName>
         <baseAddress>0x40000400</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xA</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>SLEEPCFG</name>
               <description>Sleep Configuration</description>
               <addressOffset>0x1</addressOffset>
               <size>8</size>
               <resetValue>0x02</resetValue>
               <fields>
                  <field>
                     <name>SLEEPMODE</name>
                     <description>Sleep Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>SLEEPMODESelect</name>
                        <enumeratedValue>
                           <name>IDLE</name>
                           <description>CPU, AHBx, and APBx clocks are OFF</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STANDBY</name>
                           <description>ALL clocks are OFF, unless requested by sleepwalking peripheral</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>All power domains are powered OFF</description>
                           <value>6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PLCFG</name>
               <description>Performance Level Configuration</description>
               <addressOffset>0x2</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>PLSEL</name>
                     <description>Performance Level Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>PLSELSelect</name>
                        <enumeratedValue>
                           <name>PL0</name>
                           <description>Performance Level 0</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PL2</name>
                           <description>Performance Level 2</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PLDIS</name>
                     <description>Performance Level Disable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWCFG</name>
               <description>Power Configuration</description>
               <addressOffset>0x3</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>RAMPSWC</name>
                     <description>RAM Power Switch Configuration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>RAMPSWCSelect</name>
                        <enumeratedValue>
                           <name>64KB</name>
                           <description>64KB Available</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>48KB</name>
                           <description>48KB Available</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>32KB</name>
                           <description>32KB Available</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>16KB</name>
                           <description>16KB Available</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear</description>
               <addressOffset>0x4</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>PLRDY</name>
                     <description>Performance Level Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt Enable Set</description>
               <addressOffset>0x5</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>PLRDY</name>
                     <description>Performance Level Ready interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag Status and Clear</description>
               <addressOffset>0x6</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>PLRDY</name>
                     <description>Performance Level Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STDBYCFG</name>
               <description>Standby Configuration</description>
               <addressOffset>0x8</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>PDCFG</name>
                     <description>Power Domain Configuration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PDCFGSelect</name>
                        <enumeratedValue>
                           <name>DEFAULT</name>
                           <description>PDSW power domain switching is handled by hardware.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PDSW</name>
                           <description>PDSW is forced ACTIVE.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DPGPDSW</name>
                     <description>Dynamic Power Gating for PDSW</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DPGPDSWSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Dynamic Power Gating disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Dynamic Power Gating enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VREGSMOD</name>
                     <description>Voltage Regulator Standby mode</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>VREGSMODSelect</name>
                        <enumeratedValue>
                           <name>AUTO</name>
                           <description>Automatic mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PERFORMANCE</name>
                           <description>Performance oriented</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LP</name>
                           <description>Low Power oriented</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BBIASHS</name>
                     <description>Back Bias for SRAM</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BBIASTR</name>
                     <description>Back Bias for Trust RAM</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
